# cx_Oralce 모듈
- 파이썬에서 오라클 DBMS와 연동는 다양한 함수를 제공하는 모듈
- Python DB API 2.0 표준을 따른다. 

## 참고
- [cx_Oralce 모듈 홈페이지](https://oracle.github.io/python-cx_Oracle/)
- [Python DB API](https://docs.python.org/ko/3/library/sqlite3.html)

In [2]:
!ls

파이썬 Oracle DB 연동.ipynb

In [3]:
#!pip install cx-oracle

## cx_Oracle 모듈 설치
- [설치 튜토리얼](https://cx-oracle.readthedocs.io/en/latest/user_guide/installation.html)
- 패키지 설치
```
conda install cx_oracle
pip install cx_Oracle --upgrade
```

## 코딩 절차
1. cx_Oracle 모듈 import

2. cx_Oracle모듈의 connect() 함수를 이용해 디비연결

3. Connection 객체의 cursor() 메소드를 이용해 Cursor객체 조회.
    - Cursor객체: sql문을 전송하고 select결과 조회 기능을 제공하는 객체

4. Cursor 의 execute() 메소드를 이용해 SQL문 전송

5. SELECT 의 경우 결과 조회.
    - 조회결과 한행씩 반환받아 사용
    - 조회결과 한번에 반환받아 사용

6. INSERT/DELETE/UPDATE의 경우  SQL 문 실행 후 Connection의 commit() 메소드를 이용해 Transaction 처리

7. Cursor, Connection 연결 닫기

### DB 연결
- connect() 함수를 이용하며 연결 후 Connection 객체를 받는다.
- 연결시 필요한 값
    - **host**
    - **port번호**
    - **user name**
    - **password**

### Connection 주요 메소드
- commit(): 커밋
- rollback(): 롤백
- close(): 연결 닫기

In [7]:
import cx_Oracle
# host:port/SID     SID-데이터베이스 이름.
conn1 = cx_Oracle.connect("scott", "tiger", "localhost:1521/XE") 
#DB 작업
conn1.close() #디비와 연결 닫기

In [ ]:
conn2 = cx_Oracle.connect("scott/tiger@localhost:1521/XE")
conn2.close()

#### DSN (Data Source Name) 을 이용한 연결
- DSN: DBMS를 연결하기 위한 정보를 모아 놓은 것. (서로 다른 DBMS의 연결정보를 통일하기 위해서 방식)
- makedsn(host, port번호, SID) 함수 이용해 생성한다.

In [ ]:
dsn = cx_Oracle.makedsn("localhost", 1521, "XE")

## Cursor 객체
- SQL문을 전송하고 select결과를 조회하는 메소드들을 제공한다.
- Connection객체의 cursor() 메소드로 받아온다.

### Cursor의 주요 메소드
#### SQL 실행 메소드
- execute(sql) : 하나의 sql 문 실행. 
- executemany(sql): insert, update, delete 배치 처리
    - insert, update, delete는 다 처리후 conn.commit()으로 커밋 처리해야한다.

#### select 결과 조회 메소드
- execute()로 실행한 SQL이 select인 경우 다음 메소드로 조회한다.
- fetchall()  : 조회된 모든 행을 한번에 가져올 때 사용한다. 결과를 tuple들을 묶은 리스트로 반환
- fetchone()  : 호출시 마다 한행씩 반환한다. PK로 조회한 경우 많이 사용한다.
- fetchmany(n): n행만큼 조회한다. n기본값-100. 특정개수반큼 반복문을 이용해 가져올때 사용.

In [37]:
import cx_Oracle
from pprint import pprint #pprint모듈의 pprint 함수

select_sql = 'SELECT emp_id, emp_name, salary FROM emp'
insert_sql = "insert into emp (emp_id, emp_name, job, hire_date, salary) values (865, 'hong', 'IT_PROG', to_date('20191030', 'yyyymmdd'), 30000)"

try:
    # 연결
    conn = None
    cursor = None
    
    conn = cx_Oracle.connect("scott/tiger@localhost:1521/XE")
    # Cursor 조회
    cursor = conn.cursor()
    # SQL 관련 작업.
    cursor.execute(insert_sql)
    insert_rowcount = cursor.rowcount #SQL이 적용된 행수 반환.
    print("Insert행수 :", insert_rowcount)

    cursor.execute(select_sql)
    pprint(cursor.fetchall()) #조회된 결과 다 보기
    conn.commit()#커밋처리.
except Exception as e:
    print(e)
finally:
    #연결 닫기
    if cursor:
        cursor.close()
    if conn:
        conn.close()

Insert행수 : 1
[(100, 'Steven', 24000.0),
 (101, 'Neena', 17000.0),
 (102, 'Lex', 17000.0),
 (103, 'Alexander', 9000.0),
 (104, 'Bruce', 6000.0),
 (105, 'David', 4800.0),
 (106, 'Valli', 4800.0),
 (107, 'Diana', 4200.0),
 (108, 'Nancy', 12008.0),
 (109, 'Daniel', 9000.0),
 (110, 'John', 8200.0),
 (111, 'Ismael', 7700.0),
 (112, 'Jose Manuel', 7800.0),
 (113, 'Luis', 6900.0),
 (114, 'Den', 11000.0),
 (115, 'Alexander', 7100.0),
 (116, 'Shelli', 2900.0),
 (117, 'Sigal', 2800.0),
 (118, 'Guy', 2600.0),
 (119, 'Karen', 2500.0),
 (120, 'Matthew', 8000.0),
 (121, 'Adam', 8200.0),
 (122, 'Payam', 7900.0),
 (123, 'Shanta', 6500.0),
 (124, 'Kevin', 5800.0),
 (125, 'Julia', 3200.0),
 (126, 'Irene', 2700.0),
 (127, 'James', 2400.0),
 (128, 'Steven', 2200.0),
 (129, 'Laura', 3300.0),
 (130, 'Mozhe', 2800.0),
 (131, 'James', 2500.0),
 (132, 'TJ', 2100.0),
 (133, 'Jason', 3300.0),
 (134, 'Michael', 2900.0),
 (135, 'Ki', 2400.0),
 (136, 'Hazel', 2200.0),
 (137, 'Renske', 3600.0),
 (138, 'Stephen', 3200.0),
 (139, 'John', 2700.0),
 (140, 'Joshua', 2500.0),
 (141, 'Trenna', 3500.0),
 (142, 'Curtis', 3100.0),
 (143, 'Randall', 2600.0),
 (144, 'Peter', 2500.0),
 (145, 'John', 14000.0),
 (146, 'Karen', 13500.0),
 (147, 'Alberto', 12000.0),
 (148, 'Ger%ald', 11000.0),
 (149, 'Eleni', 10500.0),
 (150, 'Peter', 10000.0),
 (151, 'David', 9500.0),
 (152, 'Peter', 9000.0),
 (153, 'Christopher', 8000.0),
 (154, 'Nanette', 7500.0),
 (155, 'Oliver', 7000.0),
 (156, 'Janette', 10000.0),
 (157, 'Patrick', 9500.0),
 (158, 'Allan', 9000.0),
 (159, 'Lindsey', 8000.0),
 (160, 'Louise', 7500.0),
 (161, 'Sarath', 7000.0),
 (162, 'Clara', 10500.0),
 (163, 'Danielle', 9500.0),
 (164, 'Mattea', 7200.0),
 (165, 'David', 6800.0),
 (166, 'Sundar', 6400.0),
 (167, 'Amit', 6200.0),
 (168, 'Lisa', 11500.0),
 (169, 'Harrison', 10000.0),
 (170, 'Tayler', 9600.0),
 (171, 'William', 7400.0),
 (172, 'Elizabeth', 7300.0),
 (173, 'Sundita', 6100.0),
 (174, 'Ellen', 11000.0),
 (175, 'Alyssa', 8800.0),
 (176, 'Jonathon', 8600.0),
 (177, 'Jack', 8400.0),
 (178, 'Kimberely', 7000.0),
 (179, 'Charles', 6200.0),
 (180, 'Winston', 3200.0),
 (181, 'Jean', 3100.0),
 (182, 'Martha', 2500.0),
 (183, 'Girard', 2800.0),
 (184, 'Nandita', 4200.0),
 (185, 'Alexis', 4100.0),
 (186, 'Julia', 3400.0),
 (187, 'Anthony', 3000.0),
 (188, 'Kelly', 3800.0),
 (189, 'Jennifer', 3600.0),
 (190, 'Timothy', 2900.0),
 (191, 'Randall', 2500.0),
 (192, 'Sarah', 4000.0),
 (193, 'Britney', 3900.0),
 (194, 'Samuel', 3200.0),
 (195, 'Vance', 2800.0),
 (196, 'Alana', 3100.0),
 (197, 'Kevin', 3000.0),
 (198, 'Donald', 2600.0),
 (199, 'Douglas', 2600.0),
 (200, 'Jennifer', 4400.0),
 (201, 'Michael', 13000.0),
 (202, 'Pat', 6000.0),
 (203, 'Susan', 6500.0),
 (204, 'Hermann', 10000.0),
 (205, 'Shelley', 12008.0),
 (206, 'William', 8300.0),
 (850, 'hong', 30000.0),
 (860, 'hong', 30000.0),
 (865, 'hong', 30000.0)]

## placeholder(자리표시자)를 이용해 sql 실행
- SQL에 값이 들어갈 자리에 값을 대신할 문자 **`:순번` 또는 `:이름`** 를 넣고 SQL 실행시 값을 전달
> placehold 는 DBMS마다 다르다. 
- execute(SQL, placeholder에 들어갈 값)
    - 딕셔너리: placeholder의 이름-값 형식
    - 리스트나 튜플: placeholder 순서

In [46]:
import cx_Oracle
from pprint import pprint #pprint모듈의 pprint 함수

select_sql = 'SELECT emp_id, emp_name, salary FROM emp where salary between :1 and :2'
insert_sql = "insert into emp (emp_id, emp_name, job, hire_date, salary) \
values (:id, :name, :job, to_date(:hire_date, 'yyyymmdd'), :salary)"

try:
    # 연결
    conn = None
    cursor = None
    
    conn = cx_Oracle.connect("scott/tiger@localhost:1521/XE")
    # Cursor 조회
    cursor = conn.cursor()
    # SQL 관련 작업.
#     insert 문 placeholder에 넣을 값 설정. -> dictionary
    i_dic = dict(id=700, name="이순신", job='FI_ACCOUNT', hire_date='20010130', salary=5000)
    cursor.execute(insert_sql, i_dic)
    insert_rowcount = cursor.rowcount #SQL이 적용된 행수 반환.
    print("Insert행수 :", insert_rowcount)

#       select 문 placeholder 넣을 값 설정 => 리스트(튜플) - :1, :2
    s.param = [5000, 10000]
    cursor.execute(select_sql, s_param)
    pprint(cursor.fetchall()) #조회된 결과 다 보기
    conn.commit()#커밋처리.
except Exception as e:
    print(e)
finally:
    #연결 닫기
    if cursor:
        cursor.close()
    if conn:
        conn.close()

Insert행수 : 1
[(103, 'Alexander', 9000.0),
 (104, 'Bruce', 6000.0),
 (109, 'Daniel', 9000.0),
 (110, 'John', 8200.0),
 (111, 'Ismael', 7700.0),
 (112, 'Jose Manuel', 7800.0),
 (113, 'Luis', 6900.0),
 (115, 'Alexander', 7100.0),
 (120, 'Matthew', 8000.0),
 (121, 'Adam', 8200.0),
 (122, 'Payam', 7900.0),
 (123, 'Shanta', 6500.0),
 (124, 'Kevin', 5800.0),
 (150, 'Peter', 10000.0),
 (151, 'David', 9500.0),
 (152, 'Peter', 9000.0),
 (153, 'Christopher', 8000.0),
 (154, 'Nanette', 7500.0),
 (155, 'Oliver', 7000.0),
 (156, 'Janette', 10000.0),
 (157, 'Patrick', 9500.0),
 (158, 'Allan', 9000.0),
 (159, 'Lindsey', 8000.0),
 (160, 'Louise', 7500.0),
 (161, 'Sarath', 7000.0),
 (163, 'Danielle', 9500.0),
 (164, 'Mattea', 7200.0),
 (165, 'David', 6800.0),
 (166, 'Sundar', 6400.0),
 (167, 'Amit', 6200.0),
 (169, 'Harrison', 10000.0),
 (170, 'Tayler', 9600.0),
 (171, 'William', 7400.0),
 (172, 'Elizabeth', 7300.0),
 (173, 'Sundita', 6100.0),
 (175, 'Alyssa', 8800.0),
 (176, 'Jonathon', 8600.0),
 (177, 'Jack', 8400.0),
 (178, 'Kimberely', 7000.0),
 (179, 'Charles', 6200.0),
 (202, 'Pat', 6000.0),
 (203, 'Susan', 6500.0),
 (204, 'Hermann', 10000.0),
 (206, 'William', 8300.0),
 (700, 'lee', 5000.0)]
조회 행수 : 45

In [2]:

select_sql = 'SELECT emp_id, emp_name, salary FROM emp '
insert_sql = "insert into emp (emp_id, emp_name, job, hire_date, salary) values "

## SELECT  결과 조회

### fetchone()
- 조회결과 한행씩 반환한다.
- PK로 조회시 사용한다.

### fetchall()
- 조회한 전체 결과셋을 반환한다.
- 한 row를 Tuple로 묶고 그 Tuple들을 List로 묶어서 반환한다.

### fetchmany(n)
- n 행씩 조회할 때 사용
- n 기본값 100

In [49]:
import cx_Oracle #위에서 이미 실행했기 때문에 불필요하나, 단독 실행했을 때 가정하에.
def select_by_id(emp_id):
    sql = "select * from emp where emp_id=:1"
    conn = None
    cursor = None
    try:
        #연결
        conn = cx_Oracle.connect("scott/tiger@localhost:1521/XE")
        #커서
        cursor = conn.cursor()
        #sql 전송
        cursor.execute(sql, [emp_id])
        #fetch - PK로 조회 => 결과행: 1: 튜플, 0:None
        result = cursor.fetchone()
        return result
    except Exception as e:
        print(e)
        e.with_traceback()
    finally:
        if cursor:
            cursor.close()
        if conn:
            conn.close()

In [51]:
result = select_by_id(100)
print(type(result))
print(result)

<class 'tuple'>
(100, 'Steven', 'AD_PRES', None, datetime.datetime(2003, 6, 17, 0, 0), 24000.0, None, 'Executive')

In [52]:
result = select_by_id(10)
print(result)

None

In [67]:
import cx_Oracle

sql = "select * from emp"
conn = None
cursor = None
try:
    #연결
    conn = cx_Oracle.connect("scott/tiger@localhost:1521/XE")
    #커서
    cursor = conn.cursor()
    #sql 전송
    cursor.execute(sql)
    #fetch - 한번에 20행만 조회
    result = cursor.fetchmany(20)
    print(result)
    print("------------", cursor.rowcount, "------------")
    result = cursor.fetchmany(20)
    print(result)
    print("------------", cursor.rowcount, "------------")
    result = cursor.fetchmany(20)
    print(result)
    print("------------", cursor.rowcount, "------------")
    result = cursor.fetchmany(20)
    print(result)
    print("------------", cursor.rowcount, "------------")
    result = cursor.fetchmany(20)
    print(result)
    print("------------", cursor.rowcount, "------------")
    result = cursor.fetchmany(20)
    print(result)
    print("------------", cursor.rowcount, "------------")
    
    
    result = cursor.fetchmany(20)
    if result:
        print(result)
        print("------------", cursor.rowcount, "------------")
    else:
        print("더이상 없음")
except Exception as e:
    print(e)
    e.with_traceback()
finally:
    if cursor:
        cursor.close()
    if conn:
        conn.close()

[(100, 'Steven', 'AD_PRES', None, datetime.datetime(2003, 6, 17, 0, 0), 24000.0, None, 'Executive'), (101, 'Neena', 'AD_VP', 100, datetime.datetime(2005, 9, 21, 0, 0), 17000.0, None, 'Executive'), (102, 'Lex', 'AD_VP', 100, datetime.datetime(2001, 1, 13, 0, 0), 17000.0, None, 'Executive'), (103, 'Alexander', 'IT_PROG', 102, datetime.datetime(2006, 1, 3, 0, 0), 9000.0, None, 'IT'), (104, 'Bruce', 'IT_PROG', 103, datetime.datetime(2007, 5, 21, 0, 0), 6000.0, None, 'IT'), (105, 'David', 'IT_PROG', 103, datetime.datetime(2005, 6, 25, 0, 0), 4800.0, None, 'IT'), (106, 'Valli', 'IT_PROG', 103, datetime.datetime(2006, 2, 5, 0, 0), 4800.0, None, 'IT'), (107, 'Diana', 'IT_PROG', 103, datetime.datetime(2007, 2, 7, 0, 0), 4200.0, None, 'IT'), (108, 'Nancy', 'FI_MGR', 101, datetime.datetime(2002, 8, 17, 0, 0), 12008.0, None, 'Finance'), (109, 'Daniel', 'FI_ACCOUNT', 108, datetime.datetime(2002, 8, 16, 0, 0), 9000.0, None, 'Finance'), (110, 'John', 'FI_ACCOUNT', 108, datetime.datetime(2005, 9, 28, 0, 0), 8200.0, None, 'Finance'), (111, 'Ismael', 'FI_ACCOUNT', 108, datetime.datetime(2005, 9, 30, 0, 0), 7700.0, None, 'Finance'), (112, 'Jose Manuel', 'FI_ACCOUNT', 108, datetime.datetime(2006, 3, 7, 0, 0), 7800.0, None, 'Finance'), (113, 'Luis', 'FI_ACCOUNT', 108, datetime.datetime(2007, 12, 7, 0, 0), 6900.0, None, 'Finance'), (114, 'Den', 'PU_MAN', 100, datetime.datetime(2002, 12, 7, 0, 0), 11000.0, None, 'Purchasing'), (115, 'Alexander', 'PU_MAN', 100, datetime.datetime(2003, 5, 18, 0, 0), 7100.0, None, 'Purchasing'), (116, 'Shelli', 'PU_CLERK', 114, datetime.datetime(2005, 12, 24, 0, 0), 2900.0, None, 'Purchasing'), (117, 'Sigal', 'PU_CLERK', 115, datetime.datetime(2005, 7, 24, 0, 0), 2800.0, None, 'Purchasing'), (118, 'Guy', 'PU_CLERK', 115, datetime.datetime(2006, 11, 15, 0, 0), 2600.0, None, 'Purchasing'), (119, 'Karen', 'PU_CLERK', 114, datetime.datetime(2007, 8, 10, 0, 0), 2500.0, None, 'Purchasing')]
------------ 20 ------------
[(120, 'Matthew', 'ST_MAN', 100, datetime.datetime(2004, 7, 18, 0, 0), 8000.0, None, 'Shipping'), (121, 'Adam', 'ST_MAN', 100, datetime.datetime(2005, 4, 10, 0, 0), 8200.0, None, 'Shipping'), (122, 'Payam', 'ST_MAN', 100, datetime.datetime(2003, 5, 1, 0, 0), 7900.0, None, 'Shipping'), (123, 'Shanta', 'ST_MAN', 100, datetime.datetime(2005, 10, 10, 0, 0), 6500.0, None, 'Shipping'), (124, 'Kevin', 'ST_MAN', 100, datetime.datetime(2007, 11, 16, 0, 0), 5800.0, None, 'Shipping'), (125, 'Julia', 'ST_CLERK', 120, datetime.datetime(2005, 7, 16, 0, 0), 3200.0, None, 'Shipping'), (126, 'Irene', 'ST_CLERK', 120, datetime.datetime(2006, 9, 28, 0, 0), 2700.0, None, 'Shipping'), (127, 'James', 'ST_CLERK', 120, datetime.datetime(2007, 1, 14, 0, 0), 2400.0, None, 'Shipping'), (128, 'Steven', 'ST_CLERK', 120, datetime.datetime(2008, 3, 8, 0, 0), 2200.0, None, 'Shipping'), (129, 'Laura', 'ST_CLERK', 121, datetime.datetime(2005, 8, 20, 0, 0), 3300.0, None, 'Shipping'), (130, 'Mozhe', 'ST_CLERK', 121, datetime.datetime(2005, 10, 30, 0, 0), 2800.0, None, 'Shipping'), (131, 'James', 'ST_CLERK', 121, datetime.datetime(2005, 2, 16, 0, 0), 2500.0, None, 'Shipping'), (132, 'TJ', 'ST_CLERK', 121, datetime.datetime(2007, 4, 10, 0, 0), 2100.0, None, 'Shipping'), (133, 'Jason', 'ST_CLERK', 122, datetime.datetime(2004, 6, 14, 0, 0), 3300.0, None, 'Shipping'), (134, 'Michael', 'ST_CLERK', 122, datetime.datetime(2006, 8, 26, 0, 0), 2900.0, None, 'Shipping'), (135, 'Ki', 'ST_CLERK', 122, datetime.datetime(2007, 12, 12, 0, 0), 2400.0, None, 'Shipping'), (136, 'Hazel', 'ST_CLERK', 122, datetime.datetime(2008, 2, 6, 0, 0), 2200.0, None, 'Shipping'), (137, 'Renske', 'ST_CLERK', 123, datetime.datetime(2003, 7, 14, 0, 0), 3600.0, None, 'Shipping'), (138, 'Stephen', 'ST_CLERK', 123, datetime.datetime(2005, 10, 26, 0, 0), 3200.0, None, 'Shipping'), (139, 'John', 'ST_CLERK', 123, datetime.datetime(2006, 2, 12, 0, 0), 2700.0, None, 'Shipping')]
------------ 40 ------------
[(140, 'Joshua', 'ST_CLERK', 123, datetime.datetime(2006, 4, 6, 0, 0), 2500.0, None, 'Shipping'), (141, 'Trenna', 'ST_CLERK', 124, datetime.datetime(2003, 10, 17, 0, 0), 3500.0, None, 'Shipping'), (142, 'Curtis', 'ST_CLERK', 124, datetime.datetime(2005, 1, 29, 0, 0), 3100.0, None, 'Shipping'), (143, 'Randall', 'ST_CLERK', 124, datetime.datetime(2006, 3, 15, 0, 0), 2600.0, None, 'Shipping'), (144, 'Peter', 'ST_CLERK', 124, datetime.datetime(2006, 7, 9, 0, 0), 2500.0, None, 'Shipping'), (145, 'John', 'SA_MAN', 100, datetime.datetime(2004, 10, 1, 0, 0), 14000.0, 0.4, 'Sales'), (146, 'Karen', 'SA_MAN', 100, datetime.datetime(2005, 1, 5, 0, 0), 13500.0, 0.3, 'Sales'), (147, 'Alberto', 'SA_MAN', 100, datetime.datetime(2005, 3, 10, 0, 0), 12000.0, 0.3, None), (148, 'Ger%ald', 'SA_MAN', 100, datetime.datetime(2007, 10, 15, 0, 0), 11000.0, 0.3, 'Sales'), (149, 'Eleni', 'SA_MAN', 100, datetime.datetime(2008, 1, 29, 0, 0), 10500.0, 0.2, 'Sales'), (150, 'Peter', 'SA_REP', 145, datetime.datetime(2005, 1, 30, 0, 0), 10000.0, 0.3, 'Sales'), (151, 'David', 'SA_REP', 145, datetime.datetime(2005, 3, 24, 0, 0), 9500.0, 0.25, 'Sales'), (152, 'Peter', 'SA_REP', 145, datetime.datetime(2005, 8, 20, 0, 0), 9000.0, 0.25, 'Sales'), (153, 'Christopher', 'SA_REP', 145, datetime.datetime(2006, 3, 30, 0, 0), 8000.0, 0.2, 'Sales'), (154, 'Nanette', 'SA_REP', 145, datetime.datetime(2006, 12, 9, 0, 0), 7500.0, 0.2, 'Sales'), (155, 'Oliver', 'SA_REP', 145, datetime.datetime(2007, 11, 23, 0, 0), 7000.0, 0.15, 'Sales'), (156, 'Janette', 'SA_REP', 146, datetime.datetime(2004, 1, 30, 0, 0), 10000.0, 0.35000000000000003, 'Sales'), (157, 'Patrick', 'SA_REP', 146, datetime.datetime(2004, 3, 4, 0, 0), 9500.0, 0.35000000000000003, 'Sales'), (158, 'Allan', 'SA_REP', 146, datetime.datetime(2004, 8, 1, 0, 0), 9000.0, 0.35000000000000003, 'Sales'), (159, 'Lindsey', 'SA_REP', 146, datetime.datetime(2005, 3, 10, 0, 0), 8000.0, 0.3, 'Sales')]
------------ 60 ------------
[(160, 'Louise', 'SA_REP', 146, datetime.datetime(2005, 12, 15, 0, 0), 7500.0, 0.3, 'Sales'), (161, 'Sarath', 'SA_REP', 146, datetime.datetime(2006, 11, 3, 0, 0), 7000.0, 0.25, 'Sales'), (162, 'Clara', 'SA_REP', 147, datetime.datetime(2005, 11, 11, 0, 0), 10500.0, 0.25, 'Sales'), (163, 'Danielle', 'SA_REP', 147, datetime.datetime(2007, 3, 19, 0, 0), 9500.0, 0.15, 'Sales'), (164, 'Mattea', 'SA_REP', 147, datetime.datetime(2008, 1, 24, 0, 0), 7200.0, 0.1, 'Sales'), (165, 'David', 'SA_REP', 147, datetime.datetime(2008, 2, 23, 0, 0), 6800.0, 0.1, 'Sales'), (166, 'Sundar', 'SA_REP', 147, datetime.datetime(2008, 3, 24, 0, 0), 6400.0, 0.1, 'Sales'), (167, 'Amit', 'SA_REP', 147, datetime.datetime(2008, 4, 21, 0, 0), 6200.0, 0.1, 'Sales'), (168, 'Lisa', 'SA_REP', 148, datetime.datetime(2005, 3, 11, 0, 0), 11500.0, 0.25, 'Sales'), (169, 'Harrison', 'SA_REP', 148, datetime.datetime(2006, 3, 23, 0, 0), 10000.0, 0.2, 'Sales'), (170, 'Tayler', 'SA_REP', 148, datetime.datetime(2006, 1, 24, 0, 0), 9600.0, 0.2, 'Sales'), (171, 'William', 'SA_REP', 148, datetime.datetime(2007, 2, 23, 0, 0), 7400.0, 0.15, 'Sales'), (172, 'Elizabeth', 'SA_REP', 148, datetime.datetime(2007, 3, 24, 0, 0), 7300.0, 0.15, 'Sales'), (173, 'Sundita', 'SA_REP', 148, datetime.datetime(2008, 4, 21, 0, 0), 6100.0, 0.1, 'Sales'), (174, 'Ellen', 'SA_REP', 149, datetime.datetime(2004, 5, 11, 0, 0), 11000.0, 0.3, 'Sales'), (175, 'Alyssa', 'SA_REP', 149, datetime.datetime(2005, 3, 19, 0, 0), 8800.0, 0.25, 'Sales'), (176, 'Jonathon', 'SA_REP', 149, datetime.datetime(2006, 3, 24, 0, 0), 8600.0, 0.2, 'Sales'), (177, 'Jack', 'SA_REP', 149, datetime.datetime(2006, 4, 23, 0, 0), 8400.0, 0.2, 'Sales'), (178, 'Kimberely', 'SA_REP', 149, datetime.datetime(2007, 5, 24, 0, 0), 7000.0, 0.15, None), (179, 'Charles', 'SA_REP', 149, datetime.datetime(2008, 1, 4, 0, 0), 6200.0, 0.1, 'Sales')]
------------ 80 ------------
[(180, 'Winston', 'SH_CLERK', 120, datetime.datetime(2006, 1, 24, 0, 0), 3200.0, None, 'Shipping'), (181, 'Jean', 'SH_CLERK', 120, datetime.datetime(2006, 2, 23, 0, 0), 3100.0, None, 'Shipping'), (182, 'Martha', 'SH_CLERK', 120, datetime.datetime(2007, 6, 21, 0, 0), 2500.0, None, 'Shipping'), (183, 'Girard', 'SH_CLERK', 120, datetime.datetime(2008, 2, 3, 0, 0), 2800.0, None, 'Shipping'), (184, 'Nandita', 'SH_CLERK', 121, datetime.datetime(2004, 1, 27, 0, 0), 4200.0, None, 'Shipping'), (185, 'Alexis', 'SH_CLERK', 121, datetime.datetime(2005, 2, 20, 0, 0), 4100.0, None, 'Shipping'), (186, 'Julia', 'SH_CLERK', 121, datetime.datetime(2006, 6, 24, 0, 0), 3400.0, None, 'Shipping'), (187, 'Anthony', 'SH_CLERK', 121, datetime.datetime(2007, 2, 7, 0, 0), 3000.0, None, 'Shipping'), (188, 'Kelly', 'SH_CLERK', 122, datetime.datetime(2005, 6, 14, 0, 0), 3800.0, None, 'Shipping'), (189, 'Jennifer', 'SH_CLERK', 122, datetime.datetime(2005, 8, 13, 0, 0), 3600.0, None, 'Shipping'), (190, 'Timothy', 'SH_CLERK', 122, datetime.datetime(2006, 7, 11, 0, 0), 2900.0, None, 'Shipping'), (191, 'Randall', 'SH_CLERK', 122, datetime.datetime(2007, 12, 19, 0, 0), 2500.0, None, 'Shipping'), (192, 'Sarah', 'SH_CLERK', 123, datetime.datetime(2004, 2, 4, 0, 0), 4000.0, None, 'Shipping'), (193, 'Britney', 'SH_CLERK', 123, datetime.datetime(2005, 3, 3, 0, 0), 3900.0, None, 'Shipping'), (194, 'Samuel', 'SH_CLERK', 123, datetime.datetime(2006, 7, 1, 0, 0), 3200.0, None, 'Shipping'), (195, 'Vance', 'SH_CLERK', 123, datetime.datetime(2007, 3, 17, 0, 0), 2800.0, None, 'Shipping'), (196, 'Alana', 'SH_CLERK', 124, datetime.datetime(2006, 4, 24, 0, 0), 3100.0, None, None), (197, 'Kevin', 'SH_CLERK', 124, datetime.datetime(2006, 5, 23, 0, 0), 3000.0, None, 'Shipping'), (198, 'Donald', 'SH_CLERK', 124, datetime.datetime(2007, 6, 21, 0, 0), 2600.0, None, 'Shipping'), (199, 'Douglas', 'SH_CLERK', 124, datetime.datetime(2008, 1, 13, 0, 0), 2600.0, None, 'Shipping')]
------------ 100 ------------
[(200, 'Jennifer', 'AD_ASST', 101, datetime.datetime(2003, 9, 17, 0, 0), 4400.0, None, 'Administration'), (201, 'Michael', 'MK_MAN', 100, datetime.datetime(2004, 2, 17, 0, 0), 13000.0, None, 'Marketing'), (202, 'Pat', 'MK_REP', 201, datetime.datetime(2005, 8, 17, 0, 0), 6000.0, None, 'Marketing'), (203, 'Susan', 'HR_REP', 101, datetime.datetime(2002, 6, 7, 0, 0), 6500.0, None, 'Human Resources'), (204, 'Hermann', 'PR_REP', 101, datetime.datetime(2002, 6, 7, 0, 0), 10000.0, None, 'Public Relations'), (205, 'Shelley', 'AC_MGR', 101, datetime.datetime(2002, 6, 7, 0, 0), 12008.0, None, 'Accounting'), (206, 'William', 'AC_ACCOUNT', 205, datetime.datetime(2002, 6, 7, 0, 0), 8300.0, None, 'Accounting'), (850, 'hong', 'IT_PROG', None, datetime.datetime(2019, 10, 10, 0, 0), 30000.0, None, None), (860, 'hong', 'IT_PROG', None, datetime.datetime(2019, 10, 30, 0, 0), 30000.0, None, None), (865, 'hong', 'IT_PROG', None, datetime.datetime(2019, 10, 30, 0, 0), 30000.0, None, None), (700, 'lee', 'FI_ACCOUNT', None, datetime.datetime(2001, 1, 30, 0, 0), 5000.0, None, None)]
------------ 111 ------------
더이상 없음

## cursor를 for in 문을 이용해 select 결과 조회
- select후 cursor는 Iterable 한 객체.
- cursor는 반복시마다 조회한 한행을 반환.

In [69]:
import cx_Oracle
sql = "select * from emp where comm_pct is not null order by emp_id"

with cx_Oracle.connect("scott/tiger@localhost:1521/XE") as conn:
    with conn.cursor() as cursor:
        try:
            cursor.execute(sql)
            for i, row in enumerate(cursor):
                print(i, row)
        except:
            print("오류 발생")

0 (145, 'John', 'SA_MAN', 100, datetime.datetime(2004, 10, 1, 0, 0), 14000.0, 0.4, 'Sales')
1 (146, 'Karen', 'SA_MAN', 100, datetime.datetime(2005, 1, 5, 0, 0), 13500.0, 0.3, 'Sales')
2 (147, 'Alberto', 'SA_MAN', 100, datetime.datetime(2005, 3, 10, 0, 0), 12000.0, 0.3, None)
3 (148, 'Ger%ald', 'SA_MAN', 100, datetime.datetime(2007, 10, 15, 0, 0), 11000.0, 0.3, 'Sales')
4 (149, 'Eleni', 'SA_MAN', 100, datetime.datetime(2008, 1, 29, 0, 0), 10500.0, 0.2, 'Sales')
5 (150, 'Peter', 'SA_REP', 145, datetime.datetime(2005, 1, 30, 0, 0), 10000.0, 0.3, 'Sales')
6 (151, 'David', 'SA_REP', 145, datetime.datetime(2005, 3, 24, 0, 0), 9500.0, 0.25, 'Sales')
7 (152, 'Peter', 'SA_REP', 145, datetime.datetime(2005, 8, 20, 0, 0), 9000.0, 0.25, 'Sales')
8 (153, 'Christopher', 'SA_REP', 145, datetime.datetime(2006, 3, 30, 0, 0), 8000.0, 0.2, 'Sales')
9 (154, 'Nanette', 'SA_REP', 145, datetime.datetime(2006, 12, 9, 0, 0), 7500.0, 0.2, 'Sales')
10 (155, 'Oliver', 'SA_REP', 145, datetime.datetime(2007, 11, 23, 0, 0), 7000.0, 0.15, 'Sales')
11 (156, 'Janette', 'SA_REP', 146, datetime.datetime(2004, 1, 30, 0, 0), 10000.0, 0.35000000000000003, 'Sales')
12 (157, 'Patrick', 'SA_REP', 146, datetime.datetime(2004, 3, 4, 0, 0), 9500.0, 0.35000000000000003, 'Sales')
13 (158, 'Allan', 'SA_REP', 146, datetime.datetime(2004, 8, 1, 0, 0), 9000.0, 0.35000000000000003, 'Sales')
14 (159, 'Lindsey', 'SA_REP', 146, datetime.datetime(2005, 3, 10, 0, 0), 8000.0, 0.3, 'Sales')
15 (160, 'Louise', 'SA_REP', 146, datetime.datetime(2005, 12, 15, 0, 0), 7500.0, 0.3, 'Sales')
16 (161, 'Sarath', 'SA_REP', 146, datetime.datetime(2006, 11, 3, 0, 0), 7000.0, 0.25, 'Sales')
17 (162, 'Clara', 'SA_REP', 147, datetime.datetime(2005, 11, 11, 0, 0), 10500.0, 0.25, 'Sales')
18 (163, 'Danielle', 'SA_REP', 147, datetime.datetime(2007, 3, 19, 0, 0), 9500.0, 0.15, 'Sales')
19 (164, 'Mattea', 'SA_REP', 147, datetime.datetime(2008, 1, 24, 0, 0), 7200.0, 0.1, 'Sales')
20 (165, 'David', 'SA_REP', 147, datetime.datetime(2008, 2, 23, 0, 0), 6800.0, 0.1, 'Sales')
21 (166, 'Sundar', 'SA_REP', 147, datetime.datetime(2008, 3, 24, 0, 0), 6400.0, 0.1, 'Sales')
22 (167, 'Amit', 'SA_REP', 147, datetime.datetime(2008, 4, 21, 0, 0), 6200.0, 0.1, 'Sales')
23 (168, 'Lisa', 'SA_REP', 148, datetime.datetime(2005, 3, 11, 0, 0), 11500.0, 0.25, 'Sales')
24 (169, 'Harrison', 'SA_REP', 148, datetime.datetime(2006, 3, 23, 0, 0), 10000.0, 0.2, 'Sales')
25 (170, 'Tayler', 'SA_REP', 148, datetime.datetime(2006, 1, 24, 0, 0), 9600.0, 0.2, 'Sales')
26 (171, 'William', 'SA_REP', 148, datetime.datetime(2007, 2, 23, 0, 0), 7400.0, 0.15, 'Sales')
27 (172, 'Elizabeth', 'SA_REP', 148, datetime.datetime(2007, 3, 24, 0, 0), 7300.0, 0.15, 'Sales')
28 (173, 'Sundita', 'SA_REP', 148, datetime.datetime(2008, 4, 21, 0, 0), 6100.0, 0.1, 'Sales')
29 (174, 'Ellen', 'SA_REP', 149, datetime.datetime(2004, 5, 11, 0, 0), 11000.0, 0.3, 'Sales')
30 (175, 'Alyssa', 'SA_REP', 149, datetime.datetime(2005, 3, 19, 0, 0), 8800.0, 0.25, 'Sales')
31 (176, 'Jonathon', 'SA_REP', 149, datetime.datetime(2006, 3, 24, 0, 0), 8600.0, 0.2, 'Sales')
32 (177, 'Jack', 'SA_REP', 149, datetime.datetime(2006, 4, 23, 0, 0), 8400.0, 0.2, 'Sales')
33 (178, 'Kimberely', 'SA_REP', 149, datetime.datetime(2007, 5, 24, 0, 0), 7000.0, 0.15, None)
34 (179, 'Charles', 'SA_REP', 149, datetime.datetime(2008, 1, 4, 0, 0), 6200.0, 0.1, 'Sales')

## INSERT / UPDATE/ DELETE
- SQL 실행 후 Connection객체의 commit()을 호출 해야 최종적으로 적용된다.
- commit()
    - 최종 적용
- rollback()
    - 변경전 상태로 되돌리기

### 사용할 테이블
```sql
create table test(
    id varchar2(10),
    name varchar2(100),
    age number(3));
```

In [74]:
import cx_Oracle
create_sql = 'create table test(id varchar2(10), name varchar2(100), age number(3))'
insert_sql = 'insert into test values (:1, :2, :3)'
select_sql = 'select * from test'
with cx_Oracle.connect('scott/tiger@localhost:1521/XE') as conn:
    with conn.cursor() as cursor:
        try:
            cursor.execute(create_sql)
        except Exception as e:
            pass
#             print(e)
#             e.with_traceback()
        try:
            cursor.execute(insert_sql, ['id-1', 'name1', 20])
            cursor.execute(insert_sql, ['id-2', 'name2', 30])
            cursor.execute(insert_sql, ['id-3', 'name3', 40])
            
            cursor.execute(select_sql)
            pprint(cursor.fetchall())
            conn.commit()
        except Exception as e:
            conn.rollback() #롤백
            print(e)

[('id-1', 'name1', 20),
 ('id-2', 'name2', 30),
 ('id-3', 'name3', 40),
 ('id-1', 'name1', 20),
 ('id-2', 'name2', 30),
 ('id-3', 'name3', 40)]

### placeholder를 이용

## batch(일괄작업) 처리
- 한번에 메소드 호출로 다수 행을 처리한다.
- executemany(sql, placeholder에 전달할값)
    - placeholder에 전달할 값을 list로 묶어서 전달하면 sql문이 그 개수만큼 한번에 처리된다.

In [7]:
import cx_Oracle

sql = "insert into test values (:1, :2, :3)"
param = [
    ['a-1', 'hong', 20],
    ['a-2', 'hong2', 27],
    ['a-3', 'hong3', 30],
    ['a-4', 'hong4', 25]
]
with cx_Oracle.connect("scott/tiger@localhost:1521/XE") as conn:
    with conn.cursor() as cursor:
        try:
            cursor.executemany(sql, param)
            cursor.execute('select * from test')
            print(cursor.fetchall())
            conn.commit()
        except Exception as e:
            conn.rollback()
            
            print("error", e)

[('id-1', 'name1', 20), ('id-2', 'name2', 30), ('id-3', 'name3', 40), ('id-1', 'name1', 20), ('id-2', 'name2', 30), ('id-3', 'name3', 40), ('a-1', 'hong', 20), ('a-2', 'hong2', 27), ('a-3', 'hong3', 30), ('a-4', 'hong4', 25)]

### TODO : 매개변수로 dept_name을 받아서 그 부서의 직원들의 salary를 두배 update하는 함수.

In [1]:
import cx_Oracle

def update_salary_double(dept_name):
    sql = "update emp set salary=salary*2 where dept_name=:1"
    with cx_Oracle.connect('scott/tiger@localhost:1521/XE') as conn:
        with conn.cursor() as cursor:
            try:
                cursor.execute(sql, [dept_name])
                conn.commit()
                return cursor.rowcount
            except Exception as e:
                conn.rollback()
                print(e)

In [4]:
update_salary_double('Finance')

6

### TODO : 매개변수로 job을 받아서 그 업무를 하는 직원들을 삭제하는 함수.

In [13]:
import cx_Oracle
def delete_by_job(job):
    sql = 'delete from emp where job=:1'
    with cx_Oracle.connect('scott/tiger@localhost:1521/XE') as conn:
        with conn.cursor() as cursor:
            try:
                cursor.execute(sql, [job])
                conn.commit()
                return cursor.rowcount
            except Exception as e:
                conn.rollback()
                print(e)

In [17]:
delete_by_job('IT_PROG')

0

# TODO : 직원 이름(emp)을 입력받아(input()) 직원의 정보를 조회결과를 출력한다.

In [ ]:
import cx_Oracle
emp_name = input("조회할 직원이름:")
sql = "select * from emp where emp_name=:1"
with cx_Oracle.connect('scott/tiger@localhost:1521/XE') as conn:
    with conn.cursor() as cursor:
        cursor.execute(sql, [emp_name])
        emp_list = cursor.fetchall()
        print(emp_list) #함수일 경우 return emp_list

# TODO: 사용자로 부터 직원정보를 입력받아 EMP 테이블에 입력한다.
- emp_id, emp_name, job, mgr_id, hire_date, salary, comm_pct, dept_name 를 하나씩 입력받는다.
- mgr_id, salary, comm_pct, dept_name을 입력하지 않은 경우 NULL 을 넣는다. (placehold 사용시 None을 대입)
- 입력된 값을 EMP 테이블에 insert 한다.

In [13]:
m = input("mgr_id: ")
m = float(m) if m else None 
# m에 m을 넣는
print(m, type(m))

mgr_id: 10.5
10.5 <class 'float'>

In [12]:
sql = 'insert into emp values (:id, :name, :job, :mgr_id, to_date(:hire_date, \'yyyy/mm/dd\'), :salary, :comm_pct, :dept_name)'
emp_id = input("ID: ").strip()
emp_name = input("직원이름:").strip()
job = input("업무:").strip()
mgr_id = input("상사ID:").strip()
mgr_id = int(mgr_id) if mgr_id else None

hire_date = input("입사일(yyyy/mm/dd):").strip()
salary = int(input("급여:").strip())

comm_pct = input("커미션율").strip()
comm_pct = float(comm_pct) if comm_pct else None

dept_name = input("부서명:").strip()
dept_name = dept_name if dept_name else None

param_dict = dict(id=emp_id, name=emp_name, job=job, mgr_id=mgr_id, salary=salary, hire_date=hire_date, comm_pct=comm_pct, dept_name=dept_name)

import cx_Oracle
with cx_Oracle.connect('scott/tiger@localhost:1521/XE') as conn:
    with conn.cursor() as cursor:
        cursor.execute(sql, param_dict)
        print("insert개수 : ", cursor.rowcount)
        cursor.execute('select * from emp where emp_id='+str(emp_id))
        print(cursor.fetchone())

ID: 997
직원이름:Kimys
업무:IT_PROG
상사ID:100
입사일(yyyy/mm/dd):2000/01/01
급여:30000
커미션율0.1
부서명:IT
insert개수 :  1
(997, 'Kimys', 'IT_PROG', 100, datetime.datetime(2000, 1, 1, 0, 0), 30000.0, 0.1, 'IT')